#********************************
# Time Information
#********************************

set_time_format -unit ns -decimal_places 3

#********************************
# Create Clock
#********************************

create_clock -name {clock} -period 40.000 -waveform {0.000 20.000} [get_ports {clk}]

#********************************
# Set Clock Uncertainty
#********************************

derive_clock_uncertainty

#********************************
# Set Input Delay
#********************************

set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {pbb}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[0]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[1]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[2]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[3]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[4]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[5]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[6]}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {sw[7]}]


set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {altera_reserved_tdi}]
set_input_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {altera_reserved_tms}]


#********************************
# Set Outnput Delay
#********************************

set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[0]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[1]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[2]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[3]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[4]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[5]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[6]}]
set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {led[7]}]

set_output_delay -add_delay -clock [get_clocks {clock}] 10.000 [get_ports {altera_reserved_tdo}]